---
title: WireMaterialTypeSet
classe: Autodesk.Revit.DB.Electrical.WireMaterialTypeSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# WireMaterialTypeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `wireMaterialTypeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `wireMaterialTypeSet.Size` | Int32 |
| `Void Clear()` | `wireMaterialTypeSet.Clear()` | Void |
| `Boolean Contains(WireMaterialType)` | `wireMaterialTypeSet.Contains(item)` | Boolean |
| `Int32 Erase(WireMaterialType)` | `wireMaterialTypeSet.Erase(item)` | Int32 |
| `WireMaterialTypeSetIterator ForwardIterator()` | `wireMaterialTypeSet.ForwardIterator()` | WireMaterialTypeSetIterator |
| `IEnumerator GetEnumerator()` | `wireMaterialTypeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(WireMaterialType)` | `wireMaterialTypeSet.Insert(item)` | Boolean |
| `WireMaterialTypeSetIterator ReverseIterator()` | `wireMaterialTypeSet.ReverseIterator()` | WireMaterialTypeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```